{
    "HEADER": {
        "Home": "Home",
        "AboutMe": "About Me",
        "Projects": "Projects",
        "Experiences": "Experiences",
        "Contact": "Contact",
        "Resume": "Resume"
    },
    "HOME": {
        "NAME": "Chris He",
        "DESCRIPTION": "Student, Software Developer"
    },
    "TECH_LIST": {
        "TITLE": "Some techs that I have used",
        "FRONT_END": "Front End",
        "BACK_END": "Back End",
        "DATA_SCIENCE": "Data Science",
        "OTHERS": "Others"
    },
    "ABOUT_ME": {
        "HEADER": "About Me",
        "DESCRIPTION": "Hi there! My name is Chris He. I am an undergrad student majoring in Computer Science at University of Waterloo.",
        "EXPERIENCES_DESCRIPTION": "Experienced in full stack development, algorithms and data structures, and Object Oriented programming. I always work as the hardest for my job, and I always seize every opportunity to learn. ",
        "Name": "Name",
        "DateOfBirth": "Date of Birth",
        "DateOfBirthVal": "January 26th, 2001",
        "Email": "Email",
        "Languages": "Languages",
        "LanguagesVal": "English, Chinese Mandarin"
    },
    "PROJECTS": {
        "PROJECTS": "Projects"
    },
    "CONTACT_ME": {
        "CONTACT_ME": "Contact Me"
    },
    "Christie Digital": {
        "TITLE": "Infrastructure & Software Developer",
        "DESCRIPTION_1": {
            "TITLE": "Developed Monitoring programs for infrastructure health using Grafana, InfluxDB and Hashicorp Consul.",
        },
        "DESCRIPTION_2": {
            "TITLE": "building Nomad nodes grouped by clusters by migrating from kubernetes cluster.(present)"
        },
        "DESCRIPTION_3": {
            "TITLE": "Automating server configuration using Ansible, Storing and distributing packages using Artifactory, Building containers and assets for development environments (Upcoming)"
        }
    },
    "5G Open RAN research lab (Rogers Inc. lab infrastructure)": {
        "TITLE": "Research Assistant Fellow",
        "DESCRIPTION_1": {
            "TITLE": "Deployed reliable network slicing based on real radio Station (USRP device) by using flexRIC(RAN intelligent Controller) and 5G core controlled by srsRAN new O-RAN CU/DU solution."
        },
        "DESCRIPTION_2": {
            "TITLE": "Monitored and Collected 50+ stats over 1+ hrs of time-series by using Grafana, Prometheus, Python FastAPI."
        },
        "DESCRIPTION_3": {
            "TITLE": "Tested variable Slicing algorithem including Static, NVS and EDF. Also researched applying ML algorithm in Slicing mapping."
        }
    },
    "Linguistic Research Team": {
        "TITLE": "Lead Developer",
        "DESCRIPTION_1": {
            "TITLE": "deployed the Monorepo full-stack project and the distributed systems at Linux service with public access using Traefik",
            "D1_D0": "One data management service powered by GOlang, and mySQL; One monorepo that containts two websites powered by react, ts, and next.js framework",
            "D1_D1": "Organize codes by Shifting computational logic out of components into helper functions, inject with custom hooks."
        },
        "DESCRIPTION_2": {
            "TITLE": "Contributed to the development of project's core features using next.js, react, typescript, golang and completed 10+ major features and 20+ feature/bug fix tickets",
            "D1_D0": "Reolved version confict of phpadmin for mysql database displaying",
            "D1_D1": "Created new API for goFigure game data request in GOlang by applying Gorilla.mux, cobra, gorm libraries",
            "D1_D2": "Created table antd react component in tsx that support sorting and filter under next.js framework",
            "D1_D3": "Fixed bug in async data fetching functions that calls API from seperate GOlang service"
        },
        "DESCRIPTION_3": {
            "TITLE": "Contributed to the project’s elicitation and analysis process by researching and generating reports. Avoided 50% of deployment time by innovating new plan after researching Kubernetes and Traefik."
        },
        "DESCRIPTION_4": {
            "TITLE": "Enhanced the CI & CD by adding jest and lint testing and introduced git hooks to improve the linguistic formats. Avoided 90% of man-made error."
        },
        "DESCRIPTION_5": {
            "TITLE": "Increased the future workflow by 20% through automating manual tasks in bash and finishing detailed documents."
        },
        "DESCRIPTION_6": {
            "TITLE": "Managed the development team of 6 developers, and resolved 30% more tickets than the previous term."
        }

    },
    "OBEL_Lab": {
        "TITLE": "ML Full-Stack Development Intern",
        "DESCRIPTION_1": {
            "TITLE": "Prototyped the full stack of FCE server with authentication for clinicians to hold capacity evaluation sessions online with nodejs. Distributed the app in both web-based with nodejs(google cloud) and standalone desktop versions with Electron.",
            "D1_D0": "Built image viewer in react to perfomr drag and zoom when special image capacity evaluation is required",
            "D1_D1": "Organize codes by Shifting computational logic out of components into helper functions, inject with custom hooks.",
            "D1_D2": "Utilized MongoDB to store user information data as web-based version"
        },
        "DESCRIPTION_2": {
            "TITLE": "Developed the pose estimation Software with ML tool Mediapipe to generate body landmark data from 2D video files. Distributed the app in both web-based with nodejs(google cloud) and standalone desktop versions with QT."
        },
        "DESCRIPTION_3": {
            "TITLE": "Delivered research in Remote FCE and Rehabilitation development analysis with the lab head director’s assist."
        }
    },
    "DingTech": {
        "TITLE": "Full Stack developer Internship",
        "DESCRIPTION_1": {
            "TITLE": "Developed the full stack of two Angular Proof of Concepts(POC) apps both independently and in small agile teams for bank clients",
            "D1_D0": "Angular POC 1 helps Payment Service Providers to register with the bank client through a set of registration proccess",
            "D1_D1": "Angular POC 2 helps HR to automate the onboarding process of new employees and see employees' progress in registration",
            "D1_D2": "Example Feature: Implemented elastic search algorithm in backend for type ahead searches in angular app"
        },
        "DESCRIPTION_2": {
            "TITLE": "Ensured delivery of Behavioral Model milestones through project management, increased work efficiency by 30% through automating manual tasks in bash and report generation in Python and Pandas"
        }
    },
    "ASSA_ABLOY": {
        "TITLE": "Software Developer Internship",
        "DESCRIPTION_1": {
            "TITLE": "Participate and build an embedded application on AX system for new product order system facing to customer.",
            "TITLE2": "Developed X++ program that automate the process of updating information between AX system to SQL server.",
            "TITLE3": "Successfully researched user experience and simplified the system structure by working with marketing and sales personnel",
            "D1_D1": "Built DICOM image viewer in React to perform drag, zoom, invert, and window/level on image",
            "D1_D2": "Developed all React components in function component with hooks and context to greatly reduce amount of code by >10%",
            "D1_D3": "Developed containerized ChRIS backend plugins in python to run COVID-Net ML models and generate analysis results in PDF"
        },
        "GENSYNTH": {
            "TITLE": "Developed X++ program that automate the process of updating information between AX system to SQL server.",
            "D1":"Revamped and Implemented new job visualization UI using directed graph to accommodate new key feature and increased test coverage by 10%",
            "D2":"Implemented delete api on model training cycles using Node, Objection.ts to allow users to free up database and server memory"
        },
        "GENSYNTH2": {
            "TITLE": "Successfully researched user experience and simplified the system structure by working with marketing and sales personnel",
            "D1":"Revamped and Implemented new job visualization UI using directed graph to accommodate new key feature and increased test coverage by 10%",
            "D2":"Implemented delete api on model training cycles using Node, Objection.ts to allow users to free up database and server memory"
        }
    },
    "CAPCO": {
        "TITLE": "Software Engineering Internship",
        "DESCRIPTION_1": {
            "TITLE": "Prototyped in a small team the full stack of Object Model Mapper with react for BSAs to automate object modeling process. Distributed the app in both web-based and standalone desktop versions.",
            "D1_D1": "Utilized MongoDB to store data for web-based version and used Node to store data as files for desktop version",
            "D1_D2": "The desktop version is built by packaging the react app using Electron and having the server as a dependency"
        },
        "DESCRIPTION_2": {
            "TITLE": "Developed the full stack of two Angular Proof of Concepts(POC) apps both independently and in small agile teams for bank clients",
            "D2_D1": "Angular POC 1 helps Payment Service Providers to register with the bank client through a set of registration proccess",
            "D2_D2": "Angular POC 2 helps HR to automate the onboarding process of new employees and see employees' progress in registration",
            "D2_D3": "Example Feature: Implemented elastic search algorithm in backend for type ahead searches in angular app"
        }
    },
    "Xmind_Education": {
        "TITLE": "ML/AI Study",
        "DESCRIPTION_1": {
            "TITLE": "Successfully researched and developed a personalized computer-vision based real estate recommender system, cybersecurity anomaly detection models, etc. using TensorFlow, Scikit-learn frameworks in Python."
        },
        "DESCRIPTION_2": {
            "TITLE": "Built, trained and fine-tuned customized CNN and RNN machine learning models on large-scale data by implementing memory mapping"
        },
        "DESCRIPTION_3": {
            "TITLE": "Successfully released the mobile app to production after numerous demo and feedback cycles"
        }
    },
    "Perfect Financial Solutions": {
        "TITLE": "Web Developer",
        "DESCRIPTION_1": {
            "TITLE": "Developed a PHP program to manage a SQL client database to automate file filling and printing process"
        },
        "DESCRIPTION_2": {
            "TITLE": "Created the full stack of a business information system for the company to manage client files, and for clients to create account, retrieve password and view their files upon login."
        },
        "DESCRIPTION_3": {
            "TITLE": "Built interactive front-end web pages and created backend of aforementioned systems with PHP"
        }
    }
}